
//----------------------------------------
#ifndef Zstandard__settings_H 
#define Zstandard__settings_H
//----------------------------------------


//-----------------------------------------------------------------------------------------------
#define ZSTD_MULTITHREAD   // - ЧТОБЫ включить многопоточность.
//-----------------------------------------------------------------------------------------------


//Собрать Zstandtart любым или доступным способом, указать в свойсвах проекта дополнительные каталоги для zstd.h и zdict.h и дополинтельные зависимости для собранного бинарника.
#include "zstd.h"     
#include "zdict.h"   



//----------------------------------------
#endif //Zstandard__settings_H 
//----------------------------------------
